app/controllers/posts_controller.rb

  def index
    @posts = Post.search(params[:search])
---
SELECT * FROM `posts`

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`updated_at`, `title`, `body`, `created_at`) VALUES('2009-12-25 03:41:50', 'Rails', 'This post is about ruby on rails.', '2009-12-25 03:41:50')